# Taps
tap "homebrew/bundle"

# ── CLI Tools ────────────────────────────────────────────────────
brew "autojump"
brew "azure-cli"
brew "bash"
brew "bfg"
brew "colima"
brew "cosign"
brew "direnv"
brew "docker"
brew "docker-completion"
brew "docker-compose"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-filter-repo"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "hcp"
brew "helix"
brew "helm"
brew "imagemagick"
brew "istioctl"
brew "k9s"
brew "kubelogin"
brew "kubernetes-cli"
brew "kustomize"
brew "mas"
brew "mkcert"
brew "neovim"
brew "node"
brew "opentofu"
brew "pandoc"
brew "pipx"
brew "podman"
brew "postgresql@14"
brew "prowler"
brew "python@3.11"
brew "python@3.12"
brew "ruby"
brew "scrcpy"
brew "skopeo"
brew "starship"
brew "terraformer"
brew "tesseract"
brew "tmux"
brew "typos-cli"
brew "vale"
brew "vault"
brew "virtualenv"
brew "watchman"
brew "weasyprint"
brew "wget"
brew "yarn"
brew "yq"

# ── Casks ────────────────────────────────────────────────────────
cask "agentkube"
cask "arc"
cask "bitwarden"
cask "brave-browser"
cask "expo-orbit"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "google-chrome@canary"
cask "imageoptim"
cask "insomnia"
cask "maccy"
cask "pgadmin4"
cask "visual-studio-code"
