# Taps
tap "hashicorp/tap"

# ── CLI Tools ────────────────────────────────────────────────────
brew "azure-cli"
brew "bash"
brew "bat"                 # cat with syntax highlighting
brew "bfg"
brew "btop"                # top, but pretty
brew "colima"
brew "cosign"
brew "direnv"
brew "docker"
brew "docker-completion"
brew "docker-compose"
brew "dust"                # du, but readable
brew "eza"                 # ls with icons + git status
brew "fd"                  # find, but sane
brew "ffmpeg"
brew "fzf"                 # fuzzy finder (Ctrl-R, Ctrl-T, Alt-C)
brew "gcc"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-delta"           # better git diffs
brew "git-filter-repo"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "hashicorp/tap/hcp"
brew "helm"
brew "imagemagick"
brew "istioctl"
brew "k9s"
brew "kubelogin"
brew "kubernetes-cli"
brew "kustomize"
brew "lazygit"             # TUI for git
brew "mas"
brew "mkcert"
brew "neovim"
brew "node"
brew "opentofu"
brew "pandoc"
brew "pipx"
brew "podman"
brew "postgresql@14"
brew "prowler"
brew "python@3.11"
brew "python@3.12"
brew "ripgrep"             # grep, but fast (rg)
brew "ruby"
brew "scrcpy"
brew "skopeo"
brew "starship"            # cross-shell prompt
brew "tealdeer"            # fast tldr client
brew "terraformer"
brew "tesseract"
brew "tmux"
brew "typos-cli"
brew "vale"
brew "hashicorp/tap/vault"
brew "virtualenv"
brew "watchman"
brew "weasyprint"
brew "wget"
brew "yarn"
brew "yq"
brew "zoxide"              # cd, but smarter (z)

# ── Casks ────────────────────────────────────────────────────────
cask "agentkube"
cask "arc"
cask "bitwarden"
cask "brave-browser"
cask "expo-orbit"
cask "font-jetbrains-mono-nerd-font"   # primary coding font (ligatures + glyphs)
cask "font-symbols-only-nerd-font"     # fallback for any glyphs not in JBM NF
cask "google-chrome@canary"
cask "imageoptim"
cask "insomnia"
cask "lm-studio"           # local LLM chat UI (MLX + GGUF)
cask "maccy"
cask "pgadmin4"
cask "visual-studio-code"
